app/views/account/posts/index.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
       <td> <%= post.content %> </td>
       <td> <%= post.group.title %> </td>