app/views/account/groups/index.html.erb

            <td> <%=  render_group_description(group) %> </td>
            <td> <%= group.posts.count %> </td>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 9]]