app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
    @posts = @group.posts.recent.paginate(:page => params[:page], :per_page => 3)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."group_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["group_id", 9], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 9]]

  def create
    @group = Group.new(group_params)
    @group.user = current_user

      if @group.save
---
INSERT INTO "groups" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ASdf"], ["description", "asdf"], ["created_at", "2017-05-30 06:45:08.053031"], ["updated_at", "2017-05-30 06:45:08.053031"], ["user_id", 1]]

   def update

     if @group.update(group_params)
---
UPDATE "groups" SET "description" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["description", "afsd"], ["updated_at", "2017-05-30 05:11:26.847813"], ["id", 7]]

   def join
     @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

   def quit
      @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

   def find_group_and_check_permission
     @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]